Tekla Open API Reference for Tekla Structures 2025
RebarLegSurfaceObject Properties
The RebarLegSurfaceObject type exposes the following members.
Properties
Name | Description
AdditionalOffset
 Gets or sets the user defined offset of the rebar legs from the leg surface object.
Class
 Gets or sets the class of the surface object.
 (Inherited from SurfaceObject.)
CreateHoles
 Gets or sets a value indicating whether CreateHoles parameter of the surface object.
 (Inherited from SurfaceObject.)
Father
 Gets or sets the father object of the surface object. The father can be set only before the Insert(), otherwise exception is thrown.
 (Inherited from SurfaceObject.)
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
LayerNumber
 Gets or sets the layer number of the leg surface object.
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 Gets or sets the name of the surface object.
 (Inherited from SurfaceObject.)
Polymesh
 Gets or sets the surface geometry brep.
 (Inherited from SurfaceObject.)
RebarSet
 Gets or sets the RebarSet to which the leg surface object belongs.
Type
 Gets or sets the type of the surface object.
 (Inherited from SurfaceObject.)
Top
See Also
Reference
RebarLegSurfaceObject Class
Tekla.Structures.Model Namespace